window.onload = function(){
	var new_1 = document.getElementById('new_1');
	var count = document.getElementById('count');
	var message1 =[
			[
				'#', 
				'img_sdzxfi_new/01.jpg',
				'UR巴纳吉',
				'#',
				'帅到一脸血《SD敢达强袭战线》人气机师推荐',
				'2016-12-06',
				'3D动作手游《SD敢达强袭战线》自不删档测试以来圈起“颜粉”无数，除了广受好评的画面效果，还有外形帅气的机体，不仅如此，更重要的是无数貌美帅气机师的存在！'
			],
			[
				'#', 
				'img_sdzxfi_new/02.jpg',
				'铁血的巴巴托斯《SD敢达强袭战线》不灭的动作情怀',
				'#',
				'铁血的巴巴托斯《SD敢达强袭战线》不灭的动作情怀',
				'2016-11-09',
				'作为铁血战争的延续，《机动战士敢达：铁血的奥尔芬斯》第二季如万千敢达迷们所愿在10月初开播。。'
			],
			[
				'#', 
				'img_sdzxfi_new/03.jpg',
				'UR巴纳吉',
				'#',
				'【18183原创】SD敢达强袭战线新手升战指南',
				'2016-11-04',
				'开往《SD敢达强袭战线》的班车马上就要发车啦，沿途将在《机动战士敢达》系列各站点稍作停靠，请乘客们给新上车的机师妹子们让个座'
			],
			[
				'#', 
				'img_sdzxfi_new/04.png',
				'UR巴纳吉',
				'#',
				'《SD敢达强袭战线》兑换码使用教程',
				'2016-11-01',
				'《SD敢达强袭战线》火爆来袭！在各位指挥官开始征战前，我们为大家准备了丰厚的战略物资。这里我们就先来告诉各位指挥官如何领取这些物资！'
			],
			[
				'#', 
				'img_sdzxfi_new/05.png',
				'UR巴纳吉',
				'#',
				'《SD敢达强袭战线》敢达擂台简介',
				'2016-10-31',
				'《SD敢达强袭战线》是由日本万代南梦宫正版授权，以超人气动漫《机动战士敢达》为主题的全新动作类手机游戏，在假想的敢达世界中任意驰骋。'
			],
			[
				'#', 
				'img_sdzxfi_new/06.jpg',
				'UR巴纳吉',
				'#',
				'《SD敢达强袭战线》不删档测试福利爆料第一弹',
				'2016-10-27',
				'《SD敢达强袭战线》不删档测试福利爆料第一弹《SD敢达强袭战线》不删档测试将于11月3日正式开始，预约火爆进行中。'
			],
			[
				'#', 
				'img_sdzxfi_new/07.jpg',
				'UR巴纳吉',
				'#',
				'公主？御姐？我要在《SD敢达强袭战线》里开高达的',
				'2016-10-25',
				'要说哪部动漫作品能够完全驾驭纯血的钢铁碰撞和姑娘们的柔情似水，真正能够拿捏到位的不过寥寥。而日本国宝级佳作《机动战士敢达》系列正是 '
			],
			[
				'#', 
				'img_sdzxfi_new/08.jpg',
				'UR巴纳吉',
				'#',
				'3D动作手游《SD敢达强袭战线》让战斗回归轻松',
				'2016-10-21',
				'3D动作手游《SD敢达强袭战线》让战斗回归轻松还记得在儿时在街机房里，一群少年挥汗如雨对着屏幕仿佛苦大仇深的摸样攻略BOSS。'
			],
			
			[
				'#', 
				'img_sdzxfi_new/09.jpg',
				'UR巴纳吉',
				'#',
				'C3空前盛况《SD敢达强袭战线》预约火爆开启',
				'2016-10-10',
				'C3北京动漫游戏大展2016，由日本创通株式会社、微影时代和星律动漫共同主办是中国大陆有史以来第一次正式引进的日本官方大型二次元展会。'
			]
		];

	function makeList(lie){
		var str ='';
		for (var i = 0;i<lie.length;i++){
			str +="<li>";
			str +='<a href="'+lie[i][0]+'">';
			str +='<img class="new_pic" src="'+lie[i][1]+'" alt="'+lie[i][2]+'"></a>';
			str +='<a class="new_text" href="'+lie[i][3]+'">';
			str +="<h2>"+lie[i][4]+"</h2>";
			str +="<strong>"+lie[i][5]+"</strong>";
			str +="<p>"+lie[i][6]+"</p>";
			str +="</a></li>";
		}
		return str;
	}

	var lis = makeList(message1);
	new_1.innerHTML = lis;
	count.innerHTML = message1.length + "条";
}